// dialogues.js

const allLevelDialogues = [
    [//day1
        "【你】\n 我叫李鬼，我的梦想是成为一名中餐大厨。\n 然而，由于资金不足，我不得不先搁置这个想法，在小镇上接手了这家汉堡店",
        "【你】\n 我相信，经过精心的制作，即使是普通的汉堡也可以受到大家的喜爱。",
        "【你】\n 「欢迎光临！\n 请问你要点什么？」",
        "【顾客】\n 「我需要一个汉堡」",
        "【提示】\n 像这样，按照顾客的要求，制作一个汉堡，并交给顾客。",
        "【提示】\n 每成功制作一个汉堡，便可以收到10元。在一年内尽可能多的收集资金吧！",
        "【你】\n 「这是你的汉堡，请慢用！」",
        "【你】\n 「谢谢，欢迎下次光临！」",
    ],
    [//day2
        "【你】\n 面包、肉饼、新鲜的蔬菜，还有各种调料，组成了每天的李鬼良心汉堡！",
        "【顾客】\n 「我来买李鬼汉堡」",
        "【你】\n 「请稍等片刻，我们正在准备。」",
        "【你】\n 「汉堡好了，感谢光临，再见！」",
    ],
    [//day3
        "【你】\n 经营汉堡店并不容易",
        "【你】\n 每天需要缴纳房租",
        "【你】\n 若是做错了汉堡，还要亏掉原料的钱",
        "【你】\n 希望明天能有更多人来买李鬼汉堡！"
    ],
    [//day4
        "【你】\n 今天顾客们的要求一如既往的奇怪。",
        "【顾客】\n 「我想买一个鲨鲨汉堡！」",
        "【你】\n 「天呢，那是什么？我从来没有听过。」",
        "【顾客】\n 「就是用鲨鲨做的汉堡！！！」"
    ],
    [//day5
        "【顾客】\n 「你好，我想要一个牛肉汉堡，请不要放洋葱。」",
        "【你】\n 「好的，请稍等。奶酪需要吗？」",
        "【顾客】\n 「当然不要！我是说，牛肉也不需要。」",
        "【你】\n 「只要面包？」",
        "【顾客】\n 「正确！」",
        "【你】\n 「好的，没问题」",
        "【你】\n 我从没见过这么奇怪的要求"
    ],
    [//day6
        "【顾客】\n 「你好，有没有素食汉堡？」",
        "【你】\n 「是的，我们什么汉堡都有」",
        "【顾客】\n 「听起来不错，我就要一个鸡肉汉堡」",
        "【你】\n 「好的，没问题」",
        "一分钟后",
        "【你】\n 「您的鸡肉汉堡好了。」",
        "【顾客】\n 「谢谢。我怎么记得我点的是虾肉汉堡？算啦，蔬菜味的也不错。」"

    ],
    [//day7
        "又完成了一天的工作",
        "凝视皓月……",
        "等等，我在干什么？",
        
    ],
    [//day8
        "【顾客】\n 「!@#$$%^&*()_」",
        "【你】\n 「+|}{1234」",
        "【顾客】\n 「asdfQWERzxcv!@#^」",
        "【你】\n 「&*()_+}{:」"
    ],
    [//day9
        "新的一天开始了",
        "今天也是热情工作的一天呢，妈妈说爱笑的女孩运气不会太差",
        "其实是因为运气差的女孩不会笑吧",
        "啊啊这样吗？诶诶"
    ],
    [//day10
        "【顾客】\n 「你听说了吗？」",
        "【你】\n 「什么事？」",
        "【顾客】\n 「学校门口的那家店，加了点「科技」……再也没有更美味的东西了，大家都想尝一尝！」",
        "【顾客】\n 「要是你也加一些在汉堡里，一定会大卖的！」"
    ],
    [//day11
        "终于工作结束了，真是太累了",
        "回家洗个热水澡，窝在沙发里听听陶喆的蓝专一定很幸福吧",
        "或许听听丁世光的神经质会更好呢"
    ],
    [//day12
        "【顾客】\n 「不知不觉，已经在你这儿吃了一年的汉堡了」",
        "【你】\n 「感谢您在这段时间里对我的支持」",
        "【顾客】\n 「开业一周年，一定会举办个疯狂的活动吧？」",
        "【你】\n 「啊……」",
        "【顾客】\n 「不开玩笑了」",
        "【顾客】\n 「我猜，你并不满足在这里工作」",
        "【顾客】\n 「你有能做出更美味的菜肴的潜质」",
        "【你】\n 「多谢您的夸奖」",
        "【你】\n 「可未来如何，还得看我这一年的收入怎么样」",
        "【你】\n 「究竟如何呢？」",
        "【你】\n 「究竟会如何呢？？」",
    ],
];
